#pragma once

#include "../Global/Define/KGDefine.h"

/*
 * 과제 10 - 1
 * - 정수를 입력 받아 홀수/짝수를 구분해서 출력하기 (단, 0 을 입력하지 않으면 계속 정수를 입력 받는다)
 * - 입력 받은 정수 중에 홀수는 왼쪽부터, 짝수는 오른쪽부터 차례대로 위치시킨다
 * 
 * Ex)
 * 정수 입력 : 1
 * 정수 입력 : 2
 * 정수 입력 : 5
 * 정수 입력 : 4
 * 정수 입력 : 7
 * 정수 입력 : 0
 * 
 * =====> 결과 <=====
 * 1, 5, 7, 4, 2
 * 
 * 
 * 과제 10 - 2
 * - 슬라이드 퍼즐 게임 제작하기 (단, 입력 가능한 2 차원 배열 크기는 제한하지 않는다)
 * 
 * Ex)
 * 과제 6 - 2 참조
 * 
 * 
 * 과제 10 - 3
 * - 달팽이 형태로 배열 요소 초기화 후 출력하기 (단, 입력 가능한 2 차원 배열 크기는 제한하지 않는다)
 * 
 * Ex)
 * 과제 6 - 3 참고
 */
namespace P10 {
	/** Practice 10 */
	int Practice_10(int argc, char* args[]);
}
